{
  "小丑鱼": {
    "description": "小丑鱼是一种热带海水鱼，以其鲜艳的橙白相间色彩著称。它们与海葵有着共生关系，海葵为小丑鱼提供保护，小丑鱼则为海葵清理寄生虫。",
    "details": "小丑鱼（学名：Amphiprioninae）是雀鲷科海葵鱼亚科鱼类的俗称，主要分布在印度洋和太平洋的温暖水域。它们体长一般在10-18厘米之间，寿命可达10年。小丑鱼是雌雄同体，具有性转换的能力。当群体中最大的雌性死亡后，最大的雄性会转变为雌性。它们主要以浮游生物、藻类和小型无脊椎动物为食。小丑鱼对海葵的毒素有免疫力，这种共生关系是海洋中最著名的共生现象之一。"
  },
  "蓝魔鬼鱼": {
    "description": "蓝魔鬼鱼是一种热带海水鱼，体色鲜蓝，性格活泼。它们主要分布在印度洋和太平洋的珊瑚礁区域，是常见的观赏鱼种。",
    "details": "蓝魔鬼鱼（学名：Chrysiptera cyanea）属于雀鲷科，体长可达8厘米。它们主要栖息在珊瑚礁区域，水深1-16米处。蓝魔鬼鱼是杂食性鱼类，以藻类、浮游生物和小型无脊椎动物为食。它们具有领地意识，会积极保护自己的领地。在繁殖季节，雄性会建造巢穴并吸引雌性产卵。蓝魔鬼鱼因其鲜艳的蓝色和活泼的性格，成为水族馆中受欢迎的观赏鱼种。"
  },
  "扇贝": {
    "description": "扇贝是一种双壳类软体动物，壳呈扇形，肉质鲜美。它们通过快速开合贝壳来游泳，是重要的海洋经济贝类。",
    "details": "扇贝（学名：Pectinidae）是双壳纲扇贝科动物的统称，全球约有300种。它们通过快速开合贝壳产生推进力，是少数能够游泳的双壳类动物。扇贝的闭壳肌（俗称\"干贝\"）是重要的海产品，富含蛋白质和微量元素。扇贝主要分布在温带和热带海域，栖息在水深10-100米的海底。它们通过过滤海水中的浮游生物获取营养，对海洋生态系统的物质循环有重要作用。"
  },
  "鲍鱼": {
    "description": "鲍鱼是一种名贵的海产贝类，肉质鲜美，壳内有珍珠层。它们主要生活在岩石缝隙中，以海藻为食。",
    "details": "鲍鱼（学名：Haliotis）是原始腹足纲鲍科动物的统称，全球约有100种。它们的外壳呈耳状，内面有珍珠光泽。鲍鱼是夜行性动物，白天躲在岩石缝隙中，夜间出来觅食。它们主要以海藻为食，通过齿舌刮食岩石表面的藻类。鲍鱼的肉质鲜美，富含蛋白质和多种微量元素，是高档海产品。由于过度捕捞，许多鲍鱼种类已濒临灭绝，需要加强保护。"
  },
  "脑珊瑚": {
    "description": "脑珊瑚因其形状酷似大脑而得名，是珊瑚礁的重要构建者。它们通过共生藻类进行光合作用，对海洋生态系统至关重要。",
    "details": "脑珊瑚（学名：Faviidae）是石珊瑚目脑珊瑚科动物的统称。它们通过分泌碳酸钙形成骨骼，是珊瑚礁的主要构建者。脑珊瑚与虫黄藻（Zooxanthellae）形成共生关系，虫黄藻通过光合作用为珊瑚提供能量，珊瑚则为虫黄藻提供保护。脑珊瑚生长缓慢，每年仅增长1-2厘米。它们对水温、盐度和光照等环境因素非常敏感，是海洋环境变化的指示物种。"
  },
  "鹿角珊瑚": {
    "description": "鹿角珊瑚分枝如鹿角，生长迅速。它们是珊瑚礁生态系统中的重要组成部分，为许多海洋生物提供栖息地。",
    "details": "鹿角珊瑚（学名：Acropora）是石珊瑚目鹿角珊瑚科动物的统称，是珊瑚礁中最重要的造礁珊瑚之一。它们的分枝状结构为许多海洋生物提供了栖息地和庇护所。鹿角珊瑚生长迅速，每年可增长10-20厘米。它们与虫黄藻共生，通过光合作用获取能量。鹿角珊瑚对水温变化非常敏感，是珊瑚白化的主要受害物种。近年来，由于全球变暖和海洋酸化，许多鹿角珊瑚种群数量急剧下降。"
  },
  "螃蟹": {
    "description": "螃蟹是一种甲壳类动物，有坚硬的外壳和两只大螯。它们分布广泛，从浅海到深海都有分布，是重要的海洋生物。",
    "details": "螃蟹（学名：Brachyura）是十足目短尾下目动物的统称，全球约有7000种。它们通过蜕皮生长，每次蜕皮后身体会增大。螃蟹是杂食性动物，以藻类、小型无脊椎动物和腐肉为食。它们具有强大的螯足，用于捕食、防御和求偶。螃蟹在海洋生态系统中扮演着重要角色，既是捕食者也是被捕食者。许多螃蟹种类是重要的经济物种，如梭子蟹、青蟹等。"
  },
  "龙虾": {
    "description": "龙虾是一种大型甲壳类动物，肉质鲜美，是高档海鲜。它们主要生活在海底岩石缝隙中，是重要的海洋经济物种。",
    "details": "龙虾（学名：Palinuridae）是十足目龙虾科动物的统称。它们体长可达60厘米，体重可达5公斤。龙虾是夜行性动物，白天躲在岩石缝隙中，夜间出来觅食。它们主要以软体动物、甲壳类和小型鱼类为食。龙虾通过蜕皮生长，每次蜕皮后身体会增大。龙虾肉质鲜美，富含蛋白质和微量元素，是高档海鲜。由于过度捕捞，许多龙虾种群数量下降，需要加强保护。"
  },
  "海马": {
    "description": "海马是一种独特的鱼类，头部像马，身体直立游泳。雄性海马负责孵化卵，是海洋中少见的由雄性承担育儿责任的物种。",
    "details": "海马（学名：Hippocampus）是海龙科海马属鱼类的统称，全球约有50种。它们体长一般在1-30厘米之间。海马是唯一一种雄性负责怀孕和分娩的脊椎动物。雌性将卵产在雄性的育儿袋中，由雄性负责孵化。海马通过背鳍快速摆动来游泳，但速度很慢。它们主要以小型甲壳类动物为食。海马因其独特的外形和繁殖方式，成为海洋生物中的明星物种。"
  },
  "海龟": {
    "description": "海龟是海洋爬行动物，寿命可达数十年。它们是海洋生态系统的重要成员，但近年来因人类活动而面临生存威胁。",
    "details": "海龟（学名：Chelonioidea）是龟鳖目海龟科动物的统称，全球现存7种。它们寿命可达80年以上，体重可达900公斤。海龟是迁徙性动物，会进行长距离迁徙。雌性海龟会回到出生地海滩产卵。海龟主要以海藻、水母和小型无脊椎动物为食。由于栖息地破坏、过度捕捞和海洋污染，所有海龟种类都面临生存威胁，被列为保护动物。"
  },
  "海星": {
    "description": "海星是一种棘皮动物，通常有五条腕。它们具有惊人的再生能力，断掉的腕可以重新生长。",
    "details": "海星（学名：Asteroidea）是棘皮动物门海星纲动物的统称，全球约有2000种。它们通过水管系统移动和捕食。海星是肉食性动物，主要以贝类、甲壳类和小型鱼类为食。它们具有惊人的再生能力，断掉的腕可以重新生长，有些种类甚至可以从一条腕再生出整个身体。海星在海洋生态系统中扮演着重要角色，既是捕食者也是被捕食者。"
  },
  "海葵": {
    "description": "海葵是一种海洋无脊椎动物，触手上有刺细胞。它们与小丑鱼等生物形成共生关系，是珊瑚礁生态系统的重要组成部分。",
    "details": "海葵（学名：Actiniaria）是刺胞动物门珊瑚纲海葵目动物的统称。它们通过基盘附着在岩石或其他硬质表面。海葵的触手上有刺细胞，可以麻痹和捕获猎物。它们与小丑鱼等生物形成共生关系，海葵为小丑鱼提供保护，小丑鱼则为海葵清理寄生虫和提供食物残渣。海葵是珊瑚礁生态系统中的重要组成部分，为许多海洋生物提供栖息地。"
  }
} 